# 3.1.6 - Introduction to groupby( )

In [2]:
# Using the split-apply into action. 

import pandas as pd
import numpy as np

In [3]:
# Apply the split-apply-combine method

classlist_a = pd.read_csv('classlist_a.csv')
classlist_b = pd.read_csv('classlist_b.csv')
classlist_c = pd.read_csv('classlist_c.csv')
classlist_d = pd.read_csv('classlist_d.csv')

print(classlist_a.shape)
print(classlist_b.shape)
print(classlist_c.shape)
print(classlist_d.shape)

(145, 5)
(126, 5)
(185, 5)
(219, 5)

# Combine the tables using concat() function

In [4]:
classlist_final = pd.concat([classlist_a, classlist_b, classlist_c, classlist_d])

classlist_final.shape

(675, 5)

# Creating the 3 groups based on surname & final mark

In [6]:
# group by surname 
group_surname = classlist_final.groupby('Surname')

group_surname

In [7]:
# group by final marks
group_marks = classlist_final.groupby('Final mark')

group_marks

In [8]:
# Combining the two groups by both surname & final marks 
group_surname_marks =classlist_final.groupby(['Surname', 'Final mark'])

group_surname_marks

In [10]:
# Combinination of the groups using aggregate()

# Sum() method into groupby()
group_surname_marks.sum()

/var/folders/cn/47qy272s11q7_n4t9zj37np40000gn/T/ipykernel_4719/300992951.py:4: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  group_surname_marks.sum()

                                           Student number
Surname                        Final mark
ABRAHAMS                       48.00             15793648
ACKERMANN                      45.00             17483638
ADENDORFF                      76.50             15849376
AFONSO                         47.72             15476227
ALBERTUS                       57.00             16564499
...                                                   ...
YOUNG                          88.05             15849390
ZINN                           74.00             17094607
ZONDAGH                        59.10             15897184
ZONDI                          74.46             16324773
ZUMA                           64.50             16782879

[673 rows x 1 columns]

In [11]:
group_surname_marks.size()

Surname                         Final mark
ABRAHAMS                        48.00         1
ACKERMANN                       45.00         1
ADENDORFF                       76.50         1
AFONSO                          47.72         1
ALBERTUS                        57.00         1
                                             ..
YOUNG                           88.05         1
ZINN                            74.00         1
ZONDAGH                         59.10         1
ZONDI                           74.46         1
ZUMA                            64.50         1
Length: 673, dtype: int64

In [12]:
group_surname.size()

Surname
ABRAHAMS                          1
ACKERMANN                         1
ADENDORFF                         1
AFONSO                            1
ALBERTUS                          1
                                 ..
YOUNG                             1
ZINN                              1
ZONDAGH                           1
ZONDI                             1
ZUMA                              1
Length: 534, dtype: int64

In [14]:
group_surname_initials.count()

                                           Student number  Final mark  Class
Surname                        Initials
ABRAHAMS                       B                        1           1      1
ACKERMANN                      E                        1           1      1
ADENDORFF                      K                        1           1      1
AFONSO                         L                        1           1      1
ALBERTUS                       S                        1           1      1
...                                                   ...         ...    ...
YOUNG                          V A                      1           1      1
ZINN                           A                        1           1      1
ZONDAGH                        L                        1           1      1
ZONDI                          WP                       1           1      1
ZUMA                           MC                       1           1      1

[666 rows x 3 columns]

In [15]:
group_initials = classlist_final.groupby('Initials')

group_surname_initials = classlist_final.groupby(['Surname', 'Initials'])

group_surname_initials.size()

Surname                         Initials
ABRAHAMS                        B             1
ACKERMANN                       E             1
ADENDORFF                       K             1
AFONSO                          L             1
ALBERTUS                        S             1
                                             ..
YOUNG                           V A           1
ZINN                            A             1
ZONDAGH                         L             1
ZONDI                           WP            1
ZUMA                            MC            1
Length: 666, dtype: int64